#+STARTUP: fold indent inlineimages

*** Keycode

- keyboard のキーに割り当てられた番号
- =$ xmodmap .Xmodmap= で設定を読み込む

- =xev= アプリでキーコードを調べることが可能
- xmodmap -pke
  - [[https://bearmini.hatenablog.com/entry/2013/07/12/161637][Xmodmap でお好みのキーバインド]]
  - 例えば =a= は =keycode 38 = a A a A= となっている (ひとつのキーで 4 つの意味を持たせる)
  - 普通に押せば、a, Shift+a = A, Mode_switch+a = a, Shift+Mode_switch+a = A という意味になる
  - =Mode_switch= のような記述を keysym と言う

#+begin_src shell
xmodmap -pke | rg Mode_switch
#+end_src

#+RESULTS:
: keycode 203 = Mode_switch NoSymbol Mode_switch

*** Modifier keys

- [[https://superuser.com/questions/417568/setting-hyper-and-super-modifiers-for-certain-keys-with-setxkbmap-or-xmodmap][Setting Hyper and Super modifiers for certain keys with setxkbmap or xmodmap@stackoverflow]]
- =xmodmap= コマンドを実行することで Modifier key の一覧を表示できる
- 括弧内が keycode (16 進数)
- Thinkpad keyboard

| Key       | Decimal |  Hex | Note        |
|-----------+---------+------+-------------|
| Control_L |      37 | 0x25 |             |
| Control_R |     105 | 0x69 |             |
| Shift_L   |      50 | 0x32 |             |
| Shift_R   |      62 | 0x3e |             |
| Alt_L     |      64 | 0x40 |             |
| Alt_R     |     108 | 0x6c |             |
| Caps_Lock |      66 | 0x42 |             |
| Num_Lock  |      77 | 0x4d | ?           |
| Super_L   |     133 | 0x85 | Windows key |
| Super_R   |     134 | 0x86 | ?           |
| Hyper_L   |     207 | 0xcf | ?           |

- 修飾キーは Real Modifier と Virtual Modifier に分かれる
  - Real Modifier は、以下の 8 種類
  - shift, lock, control, mod1-5
  - mod3 は通常使われていない
#+begin_src shell :results output
xmodmap
#+end_src

#+RESULTS:
#+begin_example
xmodmap:  up to 4 keys per modifier, (keycodes in parentheses):

shift       Shift_L (0x32),  Shift_R (0x3e)
lock        Caps_Lock (0x42)
control     Control_L (0x25),  Control_L (0x42),  Control_R (0x69)
mod1        Alt_L (0x40),  Alt_R (0x6c),  Meta_L (0xcd)
mod2        Num_Lock (0x4d)
mod3      
mod4        Super_L (0x85),  Super_R (0x86),  Super_L (0xce),  Hyper_L (0xcf)
mod5        ISO_Level3_Shift (0x5c),  Mode_switch (0xcb)

#+end_example

- 一般的には、以下のキーが用いられる
  - Control "C-"
  - Meta    "M-"
  - Super   "s-"
  - Hyper   "H-"
  - Alt     "A-"

** xkb

- =/usr/share/X11/xkb= 以下に設定ファイルが存在している
  - compat   シンボルに対してアクションを追加する
  - geometry 
  - keycodes keycode と keyname (<AE12> などの部分) を関連付ける
  - rules
  - *symbols*  keyname 毎に利用する symbol, type, action, group を指定する
  - types    どの修飾キーの組み合わせが、どの Shift-Level になるか決定する

- 用語の整理
  - keycode デバイスが X に送信する数値 (例 22)
  - keyname キーを表わす名前 (例 <AE22>)
  - keysym  キーの役割りを表わす名前 (例 BackSpace)

- [[https://stackoverflow.com/questions/28527938/xkb-configuration-for-emacs][Xkb configuration for emacs@stackoverflow]]
- [[https://wiki.archlinux.jp/index.php/X_KeyBoard_extension][X KeyBoard extension@archlinux]] 

- 現在の設定を確認
- symbols の部分がキー設定に関する部分
  - pc->us という順番で設定が上書きされていく
#+begin_src shell :results raw
setxkbmap -print
#+end_src

#+RESULTS:
xkb_keymap {
	xkb_keycodes  { include "evdev+aliases(qwerty)"	};
	xkb_types     { include "complete"	};
	xkb_compat    { include "complete"	};
	xkb_symbols   { include "pc+us+us:2+inet(evdev)"	};
	xkb_geometry  { include "pc(pc105)"	};
};

- 基本的なフロー
- =~/.xinitrc= から =~/.Xkeymap= として読み込むのが一般的
#+begin_src shell
# 現在の設定を出力
xkbcomp $DISPLAY output.xkb

# 設定を編集した後、再度システムに読み込み
xkbcomp output.xkb $DISPLAY 
#+end_src

